<template>
  <section class="section__blogs container__small">
    <div class="blogs" v-for="blog in activeBlog" :key="blog.id">
      <div class="blogs__title">
        <h2>{{ blog.title[0] }}</h2>
        <div class="blogs__img">
          <img :src="blog.imgUrl[0]" :alt="blog.imgAlt[0]" />
        </div>
      </div>
      <div class="blogs__about">
        <div class="blogs__about_data">
          <div>
            <p>{{ blog.data }}</p>
          </div>
          <div>
            <a href="#">Интерьер</a> / <a href="./index.html">Домой</a> /
            <a href="#">Декор</a>
          </div>
        </div>
        <div class="blogs__about_text">
          <p>{{ blog.details[0] }}</p>
        </div>
      </div>

      <article class="article__citation container__small">
        <div>
          <img src="./img/Blog_Detalies/Citation.svg" alt="Citation" />
        </div>
        <div>
          <h3>{{ blog.citation }}</h3>
        </div>
      </article>
      <div class="blogs container__small">
        <div class="blogs__title">
          <h2>{{ blog.title[1] }}</h2>
          <div class="blogs__about_text">
            <p>{{ blog.details[1] }}</p>
          </div>
        </div>
        <div class="blogs__about_list">
          <ol>
            <li v-for="(item, index) in blog.list" :key="index">
              {{ item }}
            </li>
          </ol>
        </div>
        <div class="blogs__img">
          <img :src="blog.imgUrl[1]" :alt="blog.imgAlt[1]" />
        </div>
        <div class="blogs__about_text">
          <p>{{ blog.details[2] }}</p>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
export default {
  name: 'DetailsComponent',
  data() {
    return {
      blogs: [
        {
          id: 1,
          tag: 'Планировка',
          title: [
            'Планировка: Создадим лучший макет перепланировки',
            'Гостиная комната является сердцем дома'
          ],
          imgUrl: ['./img/Blog_Detalies/Planning_1.jpg', './img/Blog_Detalies/Planning_2.jpg'],
          imgAlt: ['Plan_1', 'Plan_2'],
          data: '26 Декабрь,2022',
          citation:
            'Планировка комнат продумана до мелочей, чтобы удовлетворить все ваши  потребности и создать гармоничное пространство для жизни.',
          details: [
            'Планировка комнат представляет собой удобное и функциональное решение, которое обеспечивает комфортное проживание. Комнаты расположены таким образом, чтобы обеспечить максимальное удобство и рациональное использование пространства.',
            'Гостиная предназначена для отдыха, приёма гостей и проведения семейных мероприятий. Она оснащена мягкой мебелью, телевизором и аудиосистемой, создавая уютную атмосферу для приятного времяпрепровождения.',
            'Планировка комнат также включает в себя дополнительные помещения, такие как кабинет, гардеробная, кладовая и балкон. Эти помещения позволяют расширить функционал жилья и добавить удобства в повседневную жизнь.'
          ],
          list: [
            'Кухня оборудована современной техникой и мебелью, что делает процесс приготовления пищи быстрым и удобным.',
            'Столовая зона позволяет наслаждаться едой в кругу семьи и друзей, а также проводить уютные вечера за ужином.',
            'Спальные комнаты предлагают комфортное место для отдыха и сна. Они оснащены удобными кроватями, шкафами для хранения вещей и светильниками для чтения.',
            'Ванные комнаты оборудованы всем необходимым для гигиены и релаксации, обеспечивая комфортное пребывание жильцов.'
          ]
        },
        {
          id: 2,
          tag: 'Кухня',
          title: ['Кухня: Гармония стиля и функциональности', 'Harmony of style and functionality'],
          imgUrl: ['./img/Blog_Detalies/Kitchen_1.png', './img/Blog_Detalies/Kitchen_2.png'],
          imgAlt: ['Plan_1', 'Plan_2'],
          data: '30 Декабрь,2022',
          citation:
            'Создайте идеальное пространство для кулинарных экспериментов и уютных семейных вечеров.',
          details: [
            'Представляем вам стильный и функциональный интерьер кухни, который сочетает в себе современный дизайн, практичность и уют. Наша кухня создана для того, чтобы сделать процесс приготовления пищи максимально комфортным и приятным.',
            'Просторная и функциональная планировка: продуманное размещение кухонной мебели, бытовой техники и рабочих поверхностей обеспечивает удобство использования и максимальную эффективность каждого квадратного метра.',
            'Отделка высокого качества: стены, полы и потолок выполнены из долговечных и влагостойких материалов, таких как керамическая плитка, керамогранит, натуральный камень и влагостойкая краска. Это гарантирует долгий срок службы и сохранение первозданного вида интерьера даже при постоянном контакте с водой и паром.'
          ],
          list: [
            'Бытовая техника: в нашей кухне используются только высококачественные бытовые приборы от ведущих производителей. Это гарантирует надёжность, долговечность и бесшумность работы всех систем.',
            'Освещение и подсветка: в кухне предусмотрено несколько видов освещения: основное потолочное, зональное (для рабочей зоны) и декоративная подсветка. Это позволяет создать уютную атмосферу и подчеркнуть индивидуальность интерьера.',
            'Мебель и аксессуары: в нашем ассортименте представлены разнообразные модели кухонной мебели и аксессуаров, которые помогут сделать вашу кухню ещё более стильной и функциональной.'
          ]
        },

        {
          id: 3,
          tag: 'Спальня',
          title: [
            'Спальня: Качество, функциональность и эстетика.',
            'Quality, functionality and aesthetics.'
          ],
          imgUrl: ['./img/Blog_Detalies/Bedroom_1.jfif', './img/Blog_Detalies//Bedroom_2.jpg'],
          imgAlt: ['Bedroom_1', 'Bedroom_2'],
          data: '06 Январь, 2023',
          citation: 'Откройте для себя мир комфорта и уюта в вашей новой спальне!',
          details: [
            'Современная спальня сочетает в себе элегантность и практичность, обеспечивая максимальный комфорт во время отдыха и сна. Благодаря продуманному дизайну и использованию высококачественных материалов, наша спальня станет вашим любимым местом в доме.',
            'Просторная и удобная планировка: спальня оборудована всем необходимым для комфортного проживания, включая большую кровать, шкаф для одежды, прикроватные тумбочки и туалетный столик.',
            'Естественное освещение: спальня оснащена большими окнами, пропускающими достаточное количество света, что создаёт приятную атмосферу и способствует здоровому сну.'
          ],
          list: [
            'Отделка премиум-класса: стены, полы и потолки выполнены из экологически чистых материалов, обеспечивающих долговечность и безопасность.',
            'Функциональная мебель: шкаф для одежды оснащён современными системами хранения, позволяющими удобно разместить все ваши вещи. Прикроватные тумбочки и туалетный столик обеспечивают дополнительное пространство для хранения мелочей.',
            'Элементы декора: спальня украшена стильными аксессуарами, добавляющими изысканности и шарма.'
          ]
        },

        {
          id: 4,
          tag: 'Здание',
          title: ['Здание: Гармоничное пространство для жизни', 'A harmonious space for living'],
          imgUrl: ['./img/Blog_Detalies/Building_1.jpg', './img/Blog_Detalies/Building_2.jpg'],
          imgAlt: ['Building_1', 'Building_2'],
          data: '13 Январь,2023',
          citation:
            'Не упустите возможность создать идеальное пространство для комфортного проживания',
          details: [
            'Комнаты представляют собой уютное и функциональное пространство, предназначенное для комфортного проживания. Каждая комната обладает своими особенностями и назначением, обеспечивая удобство и практичность использования',
            'Гостиная — это сердце дома, где семья собирается вместе, чтобы отдохнуть, пообщаться и насладиться временем, проведённым друг с другом. В гостиной расположен мягкий уголок, телевизор и аудиосистема, создающие атмосферу уюта и расслабления.',
            'Отделка высокого качества: стены, полы и потолок выполнены из долговечных и влагостойких материалов, таких как керамическая плитка, керамогранит, натуральный камень и влагостойкая краска. Это гарантирует долгий срок службы и сохранение первозданного вида интерьера даже при постоянном контакте с водой и паром.'
          ],
          list: [
            'Кухня оборудована современной техникой и мебелью, что облегчает процесс приготовления пищи и делает его приятным и быстрым',
            'Спальные комнаты предлагают комфортное место для отдыха и сна. Они оснащены удобными кроватями, шкафами для хранения вещей и светильниками для чтения. ',
            'Ванные комнаты оборудованы всем необходимым для гигиены и релаксации, обеспечивая комфортное пребывание жильцов.',
            'Дополнительные помещения, такие как кабинет, гардеробная, кладовая и балкон, расширяют функциональность жилья и добавляют удобства в повседневную жизнь.'
          ]
        },

        {
          id: 5,
          tag: 'Архитектура',
          title: [
            'Архитектура: Максимальный комфорт и эстетическое удовольствие',
            'Maximum comfort and aesthetic pleasure'
          ],
          imgUrl: [
            './img/Blog_Detalies/Architecture_1.jpg',
            './img/Blog_Detalies/Architecture_2.jpg'
          ],
          imgAlt: ['PlaArchitecture_1', 'Architecture_2'],
          data: '22 Январь,2023',
          citation:
            'Архитектура комнат продумана до мелочей, чтобы обеспечить максимальный комфорт и эстетическое удовольствие',
          details: [
            'Архитектура комнат представляет собой уникальное сочетание классических и современных элементов, создавая атмосферу роскоши и уюта. Интерьер выполнен в тёплых тонах, которые гармонично сочетаются с изысканными деталями отделки.',
            'Просторные комнаты отличаются высокими потолками и большими окнами, которые обеспечивают отличное естественное освещение. В каждой комнате присутствует своя изюминка: в гостиной — уютный камин, в спальне — роскошная кровать с балдахином, в ванной — изысканная мозаика и ванна-джакузи.',
            'Особое внимание уделено освещению: помимо естественного света, комнаты оснащены разнообразными источниками искусственного освещения, которые позволяют создавать уютную атмосферу в любое время суток.'
          ],
          list: [
            'Мебель выполнена из высококачественных материалов и подобрана с учётом общего стиля интерьера. ',
            'В комнатах установлены удобные диваны, кресла, столы и стулья, а также вместительные шкафы и стеллажи для хранения вещей.',
            'Представлены разнообразные модели мебели и аксессуаров, которые помогут сделать ваш дом ещё более стильным и функциональным.'
          ]
        },
        {
          id: 6,
          tag: 'Ванная',
          title: ['Ванная комната: Гармония стиля и комфорта', 'Harmony of style and comfort'],
          imgUrl: ['./img/Blog_Detalies//Bathroom_1.jpeg', './img/Blog_Detalies/Bathroom_2.jpg'],
          imgAlt: ['Bathroom_1', 'Bathroom_2'],
          data: '29 Январь,2023',
          citation:
            'Не упустите возможность обновить вашу ванную комнату и создать идеальное пространство для отдыха и релаксации.',
          details: [
            'Представляем вам стильный и функциональный интерьер ванной комнаты, созданный специально для вашего комфорта и уюта.',
            'ПВ этом интерьере гармонично сочетаются современный дизайн, высококачественные материалы и инновационные технологии, обеспечивающие максимальный уровень удобства и эстетического удовольствия.',
            'Просторная и функциональная планировка: продуманное размещение всех необходимых элементов (ванна, раковина, унитаз, шкафы и т. д.) обеспечивает удобство использования и максимальную эффективность каждого квадратного метра.'
          ],
          list: [
            'Отделка высокого качества: стены, полы и потолок выполнены из долговечных и влагостойких материалов, таких как керамическая плитка, керамогранит, натуральный камень и влагостойкая краска. Это гарантирует долгий срок службы и сохранение первозданного вида интерьера даже при постоянном контакте с водой и паром.',
            'Сантехника и оборудование: в нашем интерьере используются только высококачественные сантехнические изделия и оборудование от ведущих производителей. Это гарантирует надёжность, долговечность и бесшумность работы всех систем.',
            'Освещение и подсветка: в ванной комнате предусмотрено несколько видов освещения: основное потолочное, зональное (для зеркала и рабочей зоны) и декоративная подсветка. Это позволяет создать уютную атмосферу и подчеркнуть индивидуальность интерьера.',
            'Мебель и аксессуары: в нашем ассортименте представлены разнообразные модели мебели и аксессуаров для ванной комнаты, которые помогут сделать ваш интерьер ещё более стильным и функциональным.'
          ]
        }
      ],

      setTag: 'Кухня',
      tags: ['Кухня', 'Спальня', 'Здание', 'Архитектура', 'Планировка', 'Ванная']
    }
  },
  methods: {
    toggleActiveTag(tag, event) {
      this.setTag = tag
      event.target.classList.toggle('active')
      setTimeout(() => {
        event.target.classList.remove('active')
      }, 1000)
    }
  },
  computed: {
    activeBlog() {
      return this.blogs.filter((blog) => blog.tag === this.setTag)
    }
  }
}
</script>

<style scoped>
.blogs {
  margin-bottom: 46px;
}
.blogs__img {
  display: flex;
  align-items: center;
  justify-content: center;
  object-fit: contain;
  overflow: hidden;
  max-height: 539px;
  border-radius: 50px;
}
.blogs__title h2 {
  font-family: 'DM Serif Display', sans-serif;
  font-size: 50px;
  letter-spacing: 0.02em;
  text-align: left;
  white-space: wrap;
  margin-bottom: 21px;
}
.blogs__about {
  margin-top: 46px;
}
.blogs__about_data {
  display: flex;
  flex-direction: row;
  justify-content: space-between;
  align-items: center;
}
.blogs__about p {
  margin-left: 0px;
}
.blogs__about p a {
  font-size: 16px;
  line-height: 150%;
  text-transform: capitalize;
  color: #4d5053;
}
.blogs__about_text {
  margin-top: 48px;
}
.blogs__about_text p {
  line-height: 150%;
  color: #4d5053;
  text-align: left;
}
</style>
