const productData = `
[
  {
      "id": 1,
      "name": "Ноутбук",
      "category": "Электроника"
  },
  {
      "id": 2,
      "name": "Смартфон",
      "category": "Электроника"
  },
  {
      "id": 3,
      "name": "Кофемашина",
      "category": "Бытовая техника"
  },
  {
      "id": 4,
      "name": "Фотокамера",
      "category": "Электроника"
  },
  {
      "id": 5,
      "name": "Микроваолновая печь",
      "category": "Бытовая техника"
  },
  {
      "id": 6,
      "name": "Книга 1",
      "category": "Книги"
  },
  {
      "id": 7,
      "name": "Футболка",
      "category": "Одежда"
  },
  {
      "id": 8,
      "name": "Шорты",
      "category": "Одежда"
  },
  {
      "id": 9,
      "name": "Стол",
      "category": "Мебель"
  },
  {
      "id": 10,
      "name": "Стул",
      "category": "Мебель"
  },
  {
      "id": 11,
      "name": "Книга 2",
      "category": "Книги"
  },
  {
      "id": 12,
      "name": "Пылесос",
      "category": "Бытовая техника"
  },
  {
      "id": 13,
      "name": "Комод",
      "category": "Мебель"
  },
  {
      "id": 14,
      "name": "Планшет",
      "category": "Электроника"
  },
  {
      "id": 15,
      "name": "Книга 3",
      "category": "Книги"
  },
  {
    "id": 16,
    "name": "Рубашка",
    "category": "Одежда"
}
]
`;
